# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

import itertools

for num in itertools.count(3, 1):
    if num > 10:
        break
    print(num)

iterable = ["a", "b", "c", "d"]
repeat_count = 8
cur_iteration = 0
for el in itertools.cycle(iterable):
    if cur_iteration >= repeat_count:
        break
    print(el)
    cur_iteration += 1
